import { PageBanner } from '@/app/components/page-banner/PageBanner';
import PageSectionStack from '@/app/components/page-section-stack/PageSectionStack';
import { Stack, List, Text, Heading } from '@chakra-ui/react';

import { Metadata } from 'next';

export const metadata: Metadata = {
  title:
    'Подготвителни уроци за кандидатстване в средно музикално училище – Музикален Център "Малките Големи Таланти"',
  description:
    'Научете повече за подготвителните уроци за кандидатстване в средно музикално училище, преподавани в Музикален Център "Малките Големи Таланти".',
};

const Page: React.FC = () => {
  return (
    <Stack alignItems={'center'}>
      <PageBanner
        text="Подготвителни уроци за кандидатстване в средно музикално училище"
        videoSrc="/preparatory-lessons/secondary-music-school/banner.mp4"
      />
      <PageSectionStack>
        <Stack direction={'column'}>
          <Heading>Предучилищен етап</Heading>
          <Text>
            Подготвителните уроци са предназначени за деца, на които им предстои кандидатстване и
            прием в начален и прогимназиален етап по музикално изкуство.{' '}
          </Text>
          <Text>
            За <b>ПЪРВИ КЛАС</b> - с изучаване на пиано, цигулка, виола, виолончело, контрабас,
            класическа китара, арфа, акордеон, духови инструменти /флейта, обой, кларинет, фагот,
            тромпет, валдхорна/, ударни инструменти, народно пеене и народни инструменти - се държи
            само устен изпит по солфеж.
          </Text>
          <Text fontWeight={'semibold'}>Изпит по солфеж:</Text>
          <List.Root>
            <List.Item>изпяване на песен от зададен тон</List.Item>
            <List.Item>
              подражателно възпроизвеждане на мелодични фрази и отделни гласове от хармонични
            </List.Item>
            <List.Item>интервали и акорди в мажор и минор</List.Item>
            <List.Item>
              подражателно повторение със сричката “та” на метроритмично организирани фрази върху
            </List.Item>
            <List.Item>един тон</List.Item>
            <List.Item>отгатване на единични тонове в до мажор</List.Item>
          </List.Root>
        </Stack>
      </PageSectionStack>
      <PageSectionStack bgColor={'bg.subtle'}>
        <Stack direction={'column'}>
          <Heading>Прогимназиален етап</Heading>
          <Text>
            За ученици, които желаят да кандидатстват след четвърти клас по специалностите Пиано и
            Народно пеене.
          </Text>
          <Text>
            Изпити за прием в <b>ПЕТИ КЛАС</b>
          </Text>
          <Stack>
            <Text fontWeight={'semibold'}>Пиано:</Text>
            <List.Root>
              <List.Item>
                един етюд измежду Черни, оп. 849 или от други автори с подобна трудност;
              </List.Item>
              <List.Item>полифонична пиеса; класическа сонатина І част; пиеса по избор</List.Item>
              <Text>или</Text>
              <List.Item>
                инвенция или главна част от сюита от Бах; І част от класическа соната от Хайдн,
                Моцарт
              </List.Item>
              <Text>или</Text>
              <List.Item>Бетховен (със средна трудност) и пиеса по избор</List.Item>
            </List.Root>
          </Stack>
          <Stack>
            <Text fontWeight={'semibold'}>Народно пеене:</Text>
            <Text>изпълнение на три песни в различни размери по избор на кандидата.</Text>
          </Stack>
          <Stack>
            <Text fontWeight={'semibold'}>Изпит по солфеж:</Text>
            <List.Root>
              <List.Item>
                изпяване и транспониране на заучена песен по зададено тоническо тризвучие
              </List.Item>
              <List.Item>
                слуховоподражателно възпроизвеждане на едногласни фрази, хармонични интервали и
                главни тризвучия – диатоника
              </List.Item>
              <List.Item>
                отгатване с тонови имена на единични тонове, фрази, хармонични интервали в до мажор
                или ла минор (натурален, хармоничен и мелодичен вид){' '}
              </List.Item>
            </List.Root>
          </Stack>
        </Stack>
      </PageSectionStack>
      <PageSectionStack>
        <Stack direction={'column'}>
          <Heading>Гимназиален етап</Heading>
          <Text>
            Подготвителните уроци са предназначени за ученици, на които им предстои кандидатстване и
            прием в средно музикално училище или паралелки с разширено изучаване на музика. С
            образователна степен професия музикант-инструменталист, музикант-вокалист, за
            специалностите Пиано и Поп и джаз пеене.
          </Text>
          <Text>
            Изпити за прием в <b>ОСМИ КЛАС</b>
          </Text>
          <Stack>
            <Text fontWeight={'semibold'}>Пиано:</Text>
            <List.Root>
              <List.Item>
                два етюда по избор от Черни, оп.299, ІІІ и ІV тетрадка и оп. 740 или Крамер;
                Тригласна
              </List.Item>
              <List.Item>
                инвенция или главна част от сюита от Бах; І част от класическа соната от Хайдн,
                Моцарт
              </List.Item>
              <Text>или</Text>
              <List.Item>Бетховен (със средна трудност) и пиеса по избор.</List.Item>
            </List.Root>
          </Stack>
          <Stack>
            <Text fontWeight={'semibold'}>Изпит по солфеж за специалността пиано:</Text>
            <List.Root>
              <List.Item>
                подражателно възпроизвеждане на мелодична фраза, хармонични интервали и акорди –
              </List.Item>
              <List.Item>диатоника и хроматика</List.Item>
              <List.Item>
                отгатване на единични тонове, фрази, хармонични интервали, главни тризвучия и
              </List.Item>
              <List.Item>
                обръщенията им в тоналности до два знака в мажор, натурален, хармоничен и мелодичен
                минор
              </List.Item>
              <List.Item>
                транспониране на мелодична фраза с тонови имена в тоналности до два знака
              </List.Item>
              <List.Item>
                солфежиране от пръв поглед на един солфеж в мажор или минор – диатоника до два знака
              </List.Item>
            </List.Root>
          </Stack>
          <Stack>
            <Text fontWeight={'semibold'}>Поп и джаз пеене:</Text>
            <Text>
              Изпълнение на три песни от които една от български композитор. Песните могат да бъдат
              в стил “поп”, “мюзикъл” (ария) или „джаз”. Рецитация на басня или стихотворение.
            </Text>
            <Text fontStyle="italic">
              Изпитният материал се подготвя и изпълнява със съпровод на пиано от корепетитор.
            </Text>
          </Stack>
          <Stack>
            <Text fontWeight={'semibold'}>Изпит по солфеж за специалността поп и джаз пеене:</Text>
            <List.Root>
              <List.Item>Изпяване и транспониране на песен от зададен Т5, Т6, Т6/4</List.Item>
              <List.Item>
                подражателно възпроизвеждане на фрази, хармонични интервали и акорди
              </List.Item>
              <List.Item>
                отгатване на единични тонове, фрази, хармонични интервали, главни тризвучия и
                обръщенията им в тоналностите до мажор и ла минор
              </List.Item>
              <List.Item>
                изпяване от пръв поглед на един солфеж в мажор или минор – диатоника в тоналности до
                1 знак
              </List.Item>
            </List.Root>
          </Stack>
        </Stack>
      </PageSectionStack>
    </Stack>
  );
};

export default Page;
