import { PageBanner } from '@/app/components/page-banner/PageBanner';
import { Text, Stack, Image, Heading, Box } from '@chakra-ui/react';

const Page: React.FC = () => {
  return (
    <Stack>
      <PageBanner text="Екип" />
      <Stack margin={'auto'} gap={10} w={'100vw'}>
        <Stack
          direction={'row'}
          alignItems={'center'}
          flexWrap={{ base: 'wrap', md: 'nowrap' }}
          p={10}
        >
          <Image
            flex={1}
            alt="Desislava Vasileva"
            src={'/about-us/team/Desislava.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ДЕСИСЛАВА ВАСИЛЕВА</Heading>
              <Text
                textAlign={'center'}
              >{`Създател и директор на Музикален център “Малките Големи Таланти”`}</Text>
              <Text>{`Вокален и клавирен педагог. Преподавател по теория на музикалните елементи и солфеж.
С над 25 годишен педагогически опит. Нейните възпитаници са лауреати от над 60 вокални конкурси в България и чужбина.
“Музикален център “Малките Големи Таланти” е резултат от желанието ми като музикант и педагог да създам среда, в която деца и възрастни да могат свободно да изследват своето музикално любопитство. Лично за мен най-ценното в работата ми е да откривам музикални способности или гласови особености във всеки един ученик. Да съумея да “запаля искрата” към музиката и да дам възможност на всеки едни ученик, да развива и усъвършенства музикалните си таланти в областта на вокалната или инструменталната музика.
От ранна детска възраст изучавам пиано, народно пеене, солфеж и теория на музиката. Пея в различни детско-юношески състави, с които концертирам като солист в България и чужбина. Лауреат съм от над 10 български и международни фестивали и конкурси, музикални прегледи, както от конкурси на Българското национално радио и телевизия.
Завършила съм Бакалавърска степен по “Музикална и вокална педагогика” във ВТУ “Св. св. Кирил и Методий” – гр. Велико Търново. Специализирала съм дирижиране и композиция. Моите преподаватели и вдъхновители са доц. Цветелина Славова, проф. Филип Павлов, проф. Пенчо Стоянов, проф. Киприана Беливанова, проф. Мариана Булева, проф. Сребра Михалева, Константин Манолов и др.Професионалният ми път продължава едновременно като преподавател и като концертиращ артист – хорист, вокалист. По - късно изучавам и завършвам “Музикален мениджмънт” в Нов Български университет – гр. София, със степен: Магистър, с преподаватели: доц. Д-р Ангел Заберски, Кирил Илиевски, проф. Момчил Георгиев, Елена Драгостинова, Явор Димитров, доц. Емил Лозев.
В работата си като преподавател вярвам в индивидуалния подход и поощряване на творческо изразяване и лична интерпретация. И преди всичко създаване на навици за упражнения и отговорно отношение. По - задълбочена музикална култура, чрез слушане, анализиране и изпълнение на различни стилове музика.`}</Text>
            </Stack>
          </Stack>
        </Stack>
        <Stack
          direction={'row'}
          alignItems={'center'}
          flexWrap={{ base: 'wrap', md: 'nowrap' }}
          p={10}
          bgColor={'bg.muted'}
        >
          <Image
            flex={1}
            alt="Kremena Petkova"
            src={'/about-us/team/Kremena.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>КРЕМЕНА ПЕТКОВА</Heading>
              <Text textAlign={'center'}>{`Преподавател по пиано и камерни състави`}</Text>
              <Text>{`През 2020 година в центъра се сформира класа по пиано на Кремена Петкова, с цел да обучава деца с изявени музикални способности, подготвяйки ги за концерти, конкурси, фестивали и майсторски класове, както и подготовка за кандидатстване в средни и висши музикални училища. Нейните ученици са лауреати от престижни клавирни конкурси в България и чужбина.`}</Text>
              <Text>{`“Аз съм учител по образование и пиано вдъхновител по призвание. Още от първите си срещи с музиката, имах удоволствието да уча при педагози, които се грижеха не само за развитието ми като пианист, но и оформяха музикалния ми вкус и поддържаха моето вдъхновение. И всеки ден в своята работа аз се стремя да следвам техния пример.
Завършила съм бакалавърска степен по “Музикална и клавирна педагогика” ВТУ “Св. св. Кирил и Методий” – гр. Велико Търново, в класа по пиано на изтъкнатата проф. Лилия Наумова. В своята над 25 годишна педагогическа практика съм работила с множество малки, големи и още по-големи ученици. Всеки от тях е с различна степен на музикален усет и способности, но с всеки се стремя към развитие на най-доброто на което е способен. Защото вярвам, че ученика заслужава да получи най-доброто от своя преподавател. Най-доброто от неговите знания, умения и обич. В обучението на учениците си съчетавам стандартите на класическото клавирно обучение със съвременните нужди на малките, големи и още по-големи пианисти, така че те не само да вървят напред, да подобряват своите знания и умения, но и всеки ден да научават нещо ново за музиката, да бъдат все по-вдъхновени и вълшебен свят на пианото да заема все по-голяма част от техния живот.”`}</Text>
            </Stack>
          </Stack>
        </Stack>
        <Stack
          direction={'row'}
          alignItems={'center'}
          flexWrap={{ base: 'wrap', md: 'nowrap' }}
          p={10}
        >
          <Image
            flex={1}
            alt="Teodor Chirpanliev"
            src={'/about-us/team/Teodor.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ТЕОДОР ЧИРПАНЛИЕВ</Heading>
              <Text textAlign={'center'}>{`Преподавател по барабани и ударни инструменти`}</Text>
              <Text>{`“Моето музикално пътешествие започна в НБУ ,, Михаил Лъкатник” гр. Бургас със специалност пиано. Завършвам НУМСИ ,,Проф. Панчо Владигеров” – Бургас, специалност “Ударни Инструменти” с преподавател Евгения Иванова. Бакалавърска степен в НМА ,, Проф. Панчо Владигеров” специалност “Поп и Джаз ударни инструменти” с преподаватели: проф. Христо Йоцов и Атанас Попов. Музикалното образование ми даде дълбоки познания както в класическата музика така и в много от стиловете на съвременната музика.
Преподавам в МЦ “Малките Големи Таланти” от 2021г. Изключително удоволствие е за мен да съм част от творческия, емоционалния и житейския път на децата. Чрез музиката взаимно се учим как да сме по-смели, креативни и ежедневно търсим различни начини да изразим по-добре вътрешния си свят. А когато усвоят началните умения и знания, им давам възможност да се изразят чрез своите музикалните предпочитания. Със здрава работа, усилия и търпение в обучението, несъмнено резултатите ще са налице.
Освен като преподавател съм и активен музикант в рок групи като - Cool Den, Цар Плъх, джаз формация, J-City Ensemble и други.”`}</Text>
            </Stack>
          </Stack>
        </Stack>
        <Stack
          direction={'row'}
          alignItems={'center'}
          flexWrap={{ base: 'wrap', md: 'nowrap' }}
          p={10}
          bgColor={'bg.muted'}
        >
          <Image
            flex={1}
            alt="Velislava Mancheva"
            src={'/about-us/team/Vili.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ВЕЛИСЛАВА МАНЧЕВА</Heading>
              <Text textAlign={'center'}>{`Преподавател по китара и камерни състави `}</Text>
              <Text>{`“Музиката за мен е символ на живот, разнообразие и безкрайна креативност. Без нея всичко останало съществува само в един цвят - сиво и с удоволствие предавам тази богата палитра от цветове на следващите поколения вече 8 години. 
Започнах да уча китара в НУИ “Добри Христов” гр. Варна при Севдалин Стефанов, когато бях на 9 и веднага след завършването си там продължих образованието си в НМА “Проф. Панчо Владигеров” гр. София, където и завърших магистратура при доц. Росен Балкански.
През целия ми музикален живот съм била част от различни китарни събития, печелила съм награди от различни конкурси, участвала съм на майсторски класове при невероятни професионалисти, но винаги най-голямо удоволствие ми е доставяло деленето на сцена с други музиканти и предаването на знания.”`}</Text>
            </Stack>
          </Stack>
        </Stack>
      </Stack>
    </Stack>
  );
};

export default Page;
