import { PageBanner } from '@/app/components/page-banner/PageBanner';
import PageSectionStack from '@/app/components/page-section-stack/PageSectionStack';
import { Text, Stack, Image, Heading } from '@chakra-ui/react';

import type { Metadata } from 'next';

export const metadata: Metadata = {
  title: 'Екип – Музикален Център "Малките Големи Таланти"',
  description: 'Научете повече за екипа на Музикален Център "Малките Големи Таланти".',
};

const Page: React.FC = () => {
  return (
    <Stack>
      <PageBanner text="Екип" />
      <Stack margin={'auto'} gap={10} w={'100%'}>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Desislava Vasileva"
            src={'/about-us/team/Desislava.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ДЕСИСЛАВА ВАСИЛЕВА</Heading>
              <Text
                textAlign={'center'}
              >{`Създател и директор на Музикален център “Малките Големи Таланти”`}</Text>
              <Text>{`Вокален и клавирен педагог. Преподавател по теория на музикалните елементи и солфеж.
С над 25 годишен педагогически опит. Нейните възпитаници са лауреати от над 60 вокални конкурси в България и чужбина.
“Музикален център “Малките Големи Таланти” е резултат от желанието ми като музикант и педагог да създам среда, в която деца и възрастни да могат свободно да изследват своето музикално любопитство. Лично за мен най-ценното в работата ми е да откривам музикални способности или гласови особености във всеки един ученик. Да съумея да “запаля искрата” към музиката и да дам възможност на всеки едни ученик, да развива и усъвършенства музикалните си таланти в областта на вокалната или инструменталната музика.
От ранна детска възраст изучавам пиано, народно пеене, солфеж и теория на музиката. Пея в различни детско-юношески състави, с които концертирам като солист в България и чужбина. Лауреат съм от над 10 български и международни фестивали и конкурси, музикални прегледи, както от конкурси на Българското национално радио и телевизия.
Завършила съм Бакалавърска степен по “Музикална и вокална педагогика” във ВТУ “Св. св. Кирил и Методий” – гр. Велико Търново. Специализирала съм дирижиране и композиция. Моите преподаватели и вдъхновители са доц. Цветелина Славова, проф. Филип Павлов, проф. Пенчо Стоянов, проф. Киприана Беливанова, проф. Мариана Булева, проф. Сребра Михалева, Константин Манолов и др.Професионалният ми път продължава едновременно като преподавател и като концертиращ артист – хорист, вокалист. По - късно изучавам и завършвам “Музикален мениджмънт” в Нов Български университет – гр. София, със степен: Магистър, с преподаватели: доц. Д-р Ангел Заберски, Кирил Илиевски, проф. Момчил Георгиев, Елена Драгостинова, Явор Димитров, доц. Емил Лозев.
В работата си като преподавател вярвам в индивидуалния подход и поощряване на творческо изразяване и лична интерпретация. И преди всичко създаване на навици за упражнения и отговорно отношение. По - задълбочена музикална култура, чрез слушане, анализиране и изпълнение на различни стилове музика.`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack bgColor={'bg.muted'}>
          <Image
            flex={1}
            alt="Avrora Timeva"
            src={'/about-us/team/Avrora.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>АВРОРА ТИМЕВА</Heading>
              <Text textAlign={'center'}>{`Преподавател по пиано и камерни състави`}</Text>
              <Text>{`“Да откриеш твореца в себе си“`}</Text>
              <Text>{`“Да възпитаваш в музика, това значи да възпитаваш и закаляваш волята, фантазията, мечтите, страстта и ума на една индивидуалност. Ставаш творец на самия себе си, възпитавайки всичките си сетива и способности в една безкрайна чувствителност и желязна воля да проследяваш всички нюанси на мирозданието. Модерният свят обсебен от технологиите, притъпява тези вродени заложби у всяко дете. Заниманията с музика, инструмент/пеене възвръщат и развиват тези способности. Всяко дете/човек заслужава да усети, че се е родило творец, а не само изпълнител в този свят.`}</Text>
              <Text>{`С радост съм се заела да вдъхновявам и разкривам света на музиката чрез пианото и съответната методичност, съобразена с индивидуалността и способностите на детето.
Подходът ми е напълно индивидуален според детето и неговото ниво. Вдъхновението и любовта към музиката са атмосферата, в която преподавам.`}</Text>
              <Text>{`Целта ми винаги е била да възпитавам самостоятелни музиканти и да давам всички необходими елементи, за да може ученикът да получи свобода, знания и увереност да се изразява чрез съответния език на музиката. Няма нищо по-ценно от възпитанието на тази свобода в музиката, където човек може да се срещне със своята индивидуалност, да общува със света като творец, и разбира се за децата това е безкрайно важно.
Живея под знака на музиката и театъра от дете. Имах щастието да се уча от изключителни преподаватели, които изградиха моя път като клавирен педагог, пианист, корепетитор и хоров диригент.”`}</Text>
              <Text>{`През 2014 г. Аврора Тимева завършва НМА "Проф. Панчо Владигеров” със специалност пиано в класа на проф. Иван Дреников.`}</Text>
              <Text>{`Клас по орган при проф. Нева Кръстева`}</Text>
              <Text>{`Клас по чембало при доц. Маргарита Кръстева`}</Text>
              <Text>{`Изучавала е и оперно пеене, вокални техники и импровизация при Галя Павлова, Annete Goeres, Zoila Muñoz, Бойко Цветанов, Валентин Ватев`}</Text>
              <Text>{`Освен с педагогическа дейност, активно се занимава с театър и пеене. Вярва в синтеза между различните изкуства, затова създава и участва в експериментални музикално-драматични спектакли.`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack bgColor={'bg.muted'}>
          <Image
            flex={1}
            alt="Velislava Mancheva"
            src={'/about-us/team/Vili.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ВЕЛИСЛАВА МАНЧЕВА</Heading>
              <Text textAlign={'center'}>{`Преподавател по китара и камерни състави`}</Text>
              <Text>{`“Музиката за мен е символ на живот, разнообразие и безкрайна креативност. Без нея всичко останало съществува само в един цвят - сиво и с удоволствие предавам тази богата палитра от цветове на следващите поколения вече 8 години. 
Започнах да уча китара в НУИ “Добри Христов” гр. Варна при Севдалин Стефанов, когато бях на 9 и веднага след завършването си там продължих образованието си в НМА “Проф. Панчо Владигеров” гр. София, където и завърших магистратура при доц. Росен Балкански.
През целия ми музикален живот съм била част от различни китарни събития, печелила съм награди от различни конкурси, участвала съм на майсторски класове при невероятни професионалисти, но винаги най-голямо удоволствие ми е доставяло деленето на сцена с други музиканти и предаването на знания.”`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Teodor Chirpanliev"
            src={'/about-us/team/Teodor.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ТЕОДОР ЧИРПАНЛИЕВ</Heading>
              <Text textAlign={'center'}>{`Преподавател по барабани и ударни инструменти`}</Text>
              <Text>{`“Моето музикално пътешествие започна в НБУ ,, Михаил Лъкатник” гр. Бургас със специалност пиано. Завършвам НУМСИ ,,Проф. Панчо Владигеров” – Бургас, специалност “Ударни Инструменти” с преподавател Евгения Иванова. Бакалавърска степен в НМА ,, Проф. Панчо Владигеров” специалност “Поп и Джаз ударни инструменти” с преподаватели: проф. Христо Йоцов и Атанас Попов. Музикалното образование ми даде дълбоки познания както в класическата музика така и в много от стиловете на съвременната музика.
Преподавам в МЦ “Малките Големи Таланти” от 2021г. Изключително удоволствие е за мен да съм част от творческия, емоционалния и житейския път на децата. Чрез музиката взаимно се учим как да сме по-смели, креативни и ежедневно търсим различни начини да изразим по-добре вътрешния си свят. А когато усвоят началните умения и знания, им давам възможност да се изразят чрез своите музикалните предпочитания. Със здрава работа, усилия и търпение в обучението, несъмнено резултатите ще са налице.
Освен като преподавател съм и активен музикант в рок групи като - Cool Den, Цар Плъх, джаз формация, J-City Ensemble и други.”`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Anna-Maria Vartovska"
            src={'/about-us/team/Anna-Maria.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>АННА – МАРИЯ ВЪРТОВСКА</Heading>
              <Text
                textAlign={'center'}
              >{`Преподавател по поп и джаз пеене и вокални формации`}</Text>
              <Text>{`“Аз съм музикант, защото музиката е прекрасна и искам да бъда част от нея.”`}</Text>
              <Text>{`Певица, композитор, текстописец и вокален педагог. Свири на пиано и китара.
Тя има своя група, наречена "BANDANNA", и е издала два албума с авторска
музика. Участва в различни музикални проекти и често е канена като гост-
изпълнител в No More Many More, Cool Den и други.`}</Text>
              <Text>{`"Музиката ме съпътства от ранна детска възраст. И двамата ми родители са
музиканти и за мен този начин на живот винаги е бил най-естествен. Започнах
да се занимавам професионално с пеене на седемгодишна възраст, когато
постъпих в детския радиохор, в който пях 12 години, под диригенството акад.
Христо Недялков.`}</Text>
              <Text>{`След завършване на художествената гимназия, продължих образованието си в
НБУ със специалност 'Поп и джаз пеене' в класа на проф. Етиен Леви, при когото
завърших и магистратура.`}</Text>
              <Text>{`Преди шест години започнах да преподавам пеене с искреното желание да
подкрепя всеки, който желае да развие своите способности. За мен музиката е
свещена, висша сила, която служи като изразно средство за всеки, който желае
да я слуша или изпълнява."`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Vera Nedyalkova-Doneva"
            src={'/about-us/team/Vera.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>ВЕРА НЕДЯЛКОВА – ДОНЕВА</Heading>
              <Text textAlign={'center'}>{`Преподавател по цигулка`}</Text>
              <Text>{`„Нейно Величество Цигулката“ ме завладя още от най-ранна детска
възраст. Първата ми среща с този инструмент и нотите беше дори преди да
се науча да чета и пиша, благодарение на моя първи наставник и учител
маестро Николай Лалов. В пети клас постъпих в Националното музикално
училище „Любомир Пипков“ в София, където мои преподаватели бяха
Йоахим Атанасов, Бистра Атанасова, Юлияна Манолова, Валентин
Чопаринов, Бойка Табакова и Зоран Христов, с когото завърших средното
си образование. Като дете станах част от Детската филхармония „Пионер“,
с която имах множество концерти както в България, така и в чужбина.
Продължих обучението си в Националната музикална академия „Проф.
Панчо Владигеров“ в класа по цигулка на проф. Александър Илчев,
Евгения-Мария Попова и Иван Пеев. Завърших магистратура отново под
ръководството на проф. Александър Илчев. Участвах в майсторски класове
на проф. Михаел Фришеншлагер, Ваня Миланова и други. Концертирала
съм с различни оркестри и музикални формации както в страната, така и в
чужбина – Чехия, Турция, Германия, Австрия. От 2001 г. свиря в
Академичния симфоничен оркестър на НМА „Проф. Панчо Владигеров“.`}</Text>
              <Text>{`Като преподавател, моята цел е да предам всички знания и умения, които
съм усвоила от моите изключителни учители. Искам да споделя с моите
ученици поне частица от богатия си опит на сцената и като изпълнител.
Желая да направя уроците възнаграждаващи за всеки, който се докосне до
кралицата на музикалните инструменти – цигулката!`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Selma Churukova"
            src={'/about-us/team/Selma.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>СЕЛМА ЧУРУКОВА</Heading>
              <Text textAlign={'center'}>{`Преподавател по класическо и джаз пиано`}</Text>
              <Text>{`„За мен най-важното е ученикът постепенно да започне да разбира музиката, а не просто да изпълнява написаното.“`}</Text>
              <Text>
                Професионален пианист с над 25 години сценичен и преподавателски опит. Завършва
                Националното музикално училище „Любомир Пипков“ в София с пиано при Анна Илиевска,
                Александър Василенко и проф. Милена Моллова, а по-късно и бакалавърска степен по
                „Джаз пиано“ в Националната музикална академия „Проф. Панчо Владигеров“ в класа на
                проф. Юлия Ценова. Получава стипендия за талантливи музиканти от Berklee College of
                Music и участва в майсторски класове при Чик Кориа, Милчо Левиев и др.
              </Text>
              <Text>
                Започва да свири професионално на 17-годишна възраст и през годините музицира в
                България и чужбина, включително в Дубай, Лондон, Бостън, Сволвер и Норвегия. Пише
                музика за няколко късометражни филма и получава първа специална награда за
                авторската си соло пиеса „Дистанция“ от Amsonia International Composition Contest
                (Ню Йорк). В преподаването си съчетава класическото клавирно обучение с джаз
                стандарти, хармония, импровизация и музика от различни съвременни стилове.
              </Text>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Stelian Nikolov"
            src={'/about-us/team/Stelian.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>СТЕЛЯН НИКОЛОВ</Heading>
              <Text
                textAlign={'center'}
              >{`Преподавател по перкусионни инструменти и камерни състави`}</Text>
              <Text>{`„За мен най-важната част от преподаването е да вдъхновя учениците си – да ги накарам да очакват с вълнение всеки следващ урок и да откриват нещо ново за себе си чрез музиката. Педагогическата професия ми е изключително интересна, защото всеки час носи различни емоции, случки и предизвикателства. В продължение на две години преподавах ударни инструменти в школа Music Rooms в Бургас, а сега продължавам своя педагогически път в „Малките Големи Таланти“.`}</Text>
              <Text>{`Стелян е роден в музикално семейство и още от ранна детска възраст открива музиката като естествен начин за себеизразяване. Завършва НУМСИ „Проф. Панчо Владигеров“ – Бургас, със специалност „Ударни инструменти“ в класа на Евгения Иванова. В момента продължава образованието си в Националната музикална академия „Проф. Панчо Владигеров“ със специалност „Поп и джаз ударни инструменти“.                                                                                                        Освен преподавател, той е и активен концертиращ музикант. Част от професионалния му път е свързан с група „Скарлет“ и вокален ансамбъл „Фортисимо“ (гр. Бургас), с който излиза на престижни сцени в цяла Европа и Азия.`}</Text>
            </Stack>
          </Stack>
        </PageSectionStack>
      </Stack>
    </Stack>
  );
};

export default Page;
