import { PageBanner } from '@/app/components/page-banner/PageBanner';
import { Text, Stack } from '@chakra-ui/react';

const Page: React.FC = () => {
  return (
    <Stack>
      <PageBanner imgSrc="/about-us/banner-mission.jpg" text="Мисия" />
      <Stack w={{ base: '100vw', md: '70vw' }} margin={'auto'} p={10} gap={5}>
        <Text>
          {`В края на 2018 година, се роди идеята за Музикален Център "Малките Големи Таланти". Започнахме с малко вокално студио, в което се разкриваха и обогатяваха гласовете на нашите първи ученици. Страстта към музиката и желанието да се сподели това вдъхновение станаха основата на музикалния център.`}
        </Text>
        <Text>
          {`С нарастването на интереса и успеха на нашите вокалисти, школата се разраства и предприема нова стъпка - обучение по пиано. Това допълнение позволи на учениците да разширят своите музикални хоризонти и да се изразяват чрез инструментална музика.`}
        </Text>
        <Text>
          {`След като първите ни вокални таланти постигнаха значителен успех на различни конкурси, беше ясно, че имаме пред себе си нещо специално. Това ни вдъхнови и задължи да създадем официално Музикален Център "Малките Големи Таланти", както и да открием класове по барабани и китара. От този момент, нашата мисия е да подготвяме и вдъхновяваме младите таланти да постигат върхови резултати в света на музиката и изкуствата.`}
        </Text>
        <Text>
          {`Музикален център “Малките Големи Таланти” е резултат от желанието ни като музиканти и педагози да създадем среда, в която деца и възрастни да могат свободно да изследват своето музикално и творческо любопитство.`}
        </Text>
        <Text>
          {`Разнообразието от музикални дисциплини и дейности да дадат на всеки наш ученик възможност, да развива и усъвършенства музикалните си таланти в областта на вокалната или инструменталната музика.`}
        </Text>
        <Text>
          {`Вярваме в индивидуалния подход и поощряваме творческото изразяване, като не се ограничава само до техническите аспекти на музикалното обучение.`}
        </Text>
        <Text>
          {`Откриваме уникалните музикални способности на нашите възпитаници. Вдъхновяваме, развиваме и създаваме индивидуални творци, като им предоставяме подкрепяща среда и творческа атмосфера.`}
        </Text>
      </Stack>
    </Stack>
  );
};

export default Page;
