import { PageBanner } from '@/app/components/page-banner/PageBanner';
import PageSectionStack from '@/app/components/page-section-stack/PageSectionStack';
import { Text, Stack, Image, Heading } from '@chakra-ui/react';

const Page: React.FC = () => {
  return (
    <Stack>
      <PageBanner
        text="Пиано за най-малките"
        videoSrc="/group-lessons/piano-for-little-ones/banner.mp4"
      />
      <Stack margin={'auto'} gap={10} w={'100%'}>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Image"
            src={'/group-lessons/piano-for-little-ones/piano-for-little-ones-1.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>
                Курс по пиано за малчугани в два модула - ниво I и ниво II
              </Heading>
              <Stack>
                <Text>{`В тази възрастова група децата най-лесно учат чрез игра, а няма нищо по-забавно за тях от игра с други деца. Груповите уроци по пиано дават възможност на вашето дете да развие своя интерес към музиката, към музикалния инструмент пиано и да развие базови умения.`}</Text>
                <Text>{`Курс по пиано за най-малките е специално разработена система за обучение на деца от 4 до 6 години ( 3 и 4 групи на детската градина).`}</Text>
                <Text>{`Заниманията с музика са единствените, които развиват и лявото и дясното полукълбо на мозъка, съчетавайки, във всеки един урок, творческото, логическото и аналитично мислене на детето. Пианото освен красив е и голям музикален инструмент и свиренето на него развива пространството ориентация на малките деца. Правилната постановка на тялото и ръцете при свирене на пиано подържа изправена стойката на детето и укрепва гръбначния стълб. Уменията за натискане на клавишите и натиска от един или няколко пръста на ръката,  укрепват финната моторика. По време на урока детето трябва да запомня различни факти, да различава и познава различни графичните изображения на музикалните знаци от нотния текст. Всички тези дейности изключително много спомагот за умственото му развитие. `}</Text>
              </Stack>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack bgColor={'bg.subtle'}>
          <Image
            flex={1}
            alt="Image"
            src={'/group-lessons/piano-for-little-ones/piano-for-little-ones-2.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>Първи модул – Ниво I</Heading>
              <Stack>
                <Text>{`В първо ниво от 16 учебни седмици през които децата се научават как да седят на пианото, как да свирят с отделни пръсти на дясна и лява ръка.  Тоновата стълбица и имената на нотите. Октавовите групи и тоновите трайности. Под формата на игра децата придобиват практически умения и теоретични знания, необходими за по-нататъчното музикално развитие.`}</Text>
                <Text>{`Първи модул завършва с открит урок под формата на мини концерт, в който родителите могат да видят на живо уменията и знанията придобити от техните деца.`}</Text>
                <Text
                  fontWeight={'semibold'}
                >{`Децата завършили успешно Ниво I имат право да продължат в Ниво II.`}</Text>
              </Stack>
            </Stack>
          </Stack>
        </PageSectionStack>
        <PageSectionStack>
          <Image
            flex={1}
            alt="Image"
            src={'/group-lessons/piano-for-little-ones/piano-for-little-ones-3.jpg'}
            maxH={'400px'}
            margin={'auto'}
            fit="contain"
          />
          <Stack flex={1}>
            <Stack>
              <Heading textAlign={'center'}>Втори модул – Ниво II</Heading>
              <Stack>
                <Text>{`Във второто ниво  от 16 учебни седмици, децата  доразвиват своите умения и знания придобити в Ниво I. Свирене с няколко от пръстите на всяка ръка, както и свирене с две ръце. Надграждат своите знания за музикалните знаци,  размери, щрихи различни техники и начини на звукизвличане. Разпознаване, тактуване и изсвирване на нотни трайности. Разчитане на нотен текст. Разпознаване на нотните ключове сол и фа. Чрез музикални игри и изпълнения на песнички детето се учи на вярно интониране и успешно развива на мелодичния и ритмичен слух. `}</Text>
                <Text>{`Второто ниво на обучение завършва с мини концерт - продукция на децата. Най-добрите свирят в годишната продукция - концерт на Музикален център "Малките големи таланти".`}</Text>
              </Stack>
            </Stack>
          </Stack>
        </PageSectionStack>
      </Stack>
    </Stack>
  );
};

export default Page;
